
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 4 to change, 3 to destroy.</code></pre>

* Create
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.java-alerting.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.nodejs_alerting.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.third_party_subscription_alerting.azurerm_resource_group_template_deployment.custom_alert[0]
* Update
  * azurerm_api_management_subscription.product[0]
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
* Delete
  * azurerm_federated_identity_credential.pip_crime_federated_connection[0]
* Replace
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_federated_identity_credential.pip_crime_federated_connection[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_federated_identity_credential" "pip_crime_federated_connection" {
      - audience            = [
          - "api://AzureADTokenExchange",
        ] -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-cp-stg-mi/federatedIdentityCredentials/pip-stg-crime-federated-credential" -> null
      - issuer              = "https://uksouth.oic.prod-aks.azure.com/e2995d11-9947-4e78-9de6-d44e0603518e/0dccffda-21f3-4db3-bca7-9f8392cf3587/" -> null
      - name                = "pip-stg-crime-federated-credential" -> null
      - parent_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-cp-stg-mi" -> null
      - resource_group_name = "managed-identities-stg-rg" -> null
      - subject             = "system:serviceaccount:default:pip-stg-cp-service-account" -> null
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "bbb5ea2fcd677c8ad1ce5bd639cffdc6" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw-en.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "b6b14ede9010078a52734ff27cf7c630" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be created
  + resource "azurerm_resource_group_template_deployment" "action-group" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "CaTH-Group"
      + output_content      = (known after apply)
      + parameters_content  = (sensitive value)
      + resource_group_name = "pip-ss-stg-rg"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName      = {
                      + type = "string"
                    }
                  + emailReceiverAddress = {
                      + metadata = {
                          + description = "Email address of the receiver"
                        }
                      + type     = "string"
                    }
                  + emailReceiverName    = {
                      + metadata = {
                          + description = "Name of the email receiver"
                        }
                      + type     = "string"
                    }
                  + location             = {
                      + defaultValue = "global"
                      + type         = "string"
                    }
                  + shortName            = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-04-01"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('actionGroupName')]"
                      + properties = {
                          + emailReceivers   = [
                              + {
                                  + emailAddress = "[parameters('emailReceiverAddress')]"
                                  + name         = "[parameters('emailReceiverName')]"
                                },
                            ]
                          + enabled          = true
                          + groupShortName   = "[parameters('shortName')]"
                          + smsReceivers     = []
                          + webhookReceivers = []
                        }
                      + tags       = {}
                      + type       = "microsoft.insights/actionGroups"
                    },
                ]
            }
        )
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-03-01T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-02-29T09:23:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.java-alerting.data.template_file.metricalerttemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "metricalerttemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.java-alerting.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "CaTH-Java-Exception-Alerting"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "CaTH Email Group"
                }
              + actionGroupRg            = {
                  + value = "pip-ss-stg-rg"
                }
              + alertDesc                = {
                  + value = "Triggers when java exceptions occurred within a 15 minutes interval"
                }
              + alertName                = {
                  + value = "CaTH-Java-Exception-Alerting"
                }
              + appInsightsName          = {
                  + value = "pip-ss-stg-java-appinsights"
                }
              + appInsightsQuery         = {
                  + value = "exceptions"
                }
              + commonTags               = {
                  + value = "eyJhcHBsaWNhdGlvbiI6InB1Ymxpc2hpbmctaW5mb3JtYXRpb24tc2VydmljZSIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvcGlwLXNoYXJlZC1pbmZyYXN0cnVjdHVyZXMuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ3Jvc3MtQ3V0dGluZyIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcHVibGlzaGluZy1hbmQtaW5mb3JtYXRpb24iLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJGdXR1cmUgSGVhcmluZ3MgLSBQdWJsaXNoaW5nIEluZm9ybWF0aW9uIFByb2plY3QifQ=="
                }
              + customEmailSubject       = {
                  + value = "Exceptions in CaTH java applications"
                }
              + frequencyInMinutes       = {
                  + value = "5"
                }
              + location                 = {
                  + value = "uksouth"
                }
              + severityLevel            = {
                  + value = "2"
                }
              + timeWindowInMinutes      = {
                  + value = "5"
                }
              + triggerThreshold         = {
                  + value = "0"
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "pip-ss-stg-rg"
      + template_content    = (known after apply)
    }

  # module.nodejs_alerting.data.template_file.metricalerttemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "metricalerttemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.nodejs_alerting.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "CaTH-Nodejs-Exception-Alerting"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "CaTH Email Group"
                }
              + actionGroupRg            = {
                  + value = "pip-ss-stg-rg"
                }
              + alertDesc                = {
                  + value = "Triggers when nodejs exceptions occurred within a 15 minutes interval"
                }
              + alertName                = {
                  + value = "CaTH-Nodejs-Exception-Alerting"
                }
              + appInsightsName          = {
                  + value = "pip-ss-stg-nodejs-appinsights"
                }
              + appInsightsQuery         = {
                  + value = "exceptions"
                }
              + commonTags               = {
                  + value = "eyJhcHBsaWNhdGlvbiI6InB1Ymxpc2hpbmctaW5mb3JtYXRpb24tc2VydmljZSIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvcGlwLXNoYXJlZC1pbmZyYXN0cnVjdHVyZXMuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ3Jvc3MtQ3V0dGluZyIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcHVibGlzaGluZy1hbmQtaW5mb3JtYXRpb24iLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJGdXR1cmUgSGVhcmluZ3MgLSBQdWJsaXNoaW5nIEluZm9ybWF0aW9uIFByb2plY3QifQ=="
                }
              + customEmailSubject       = {
                  + value = "Exceptions in CaTH nodejs application"
                }
              + frequencyInMinutes       = {
                  + value = "5"
                }
              + location                 = {
                  + value = "uksouth"
                }
              + severityLevel            = {
                  + value = "2"
                }
              + timeWindowInMinutes      = {
                  + value = "5"
                }
              + triggerThreshold         = {
                  + value = "0"
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "pip-ss-stg-rg"
      + template_content    = (known after apply)
    }

  # module.third_party_subscription_alerting.data.template_file.metricalerttemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "metricalerttemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.third_party_subscription_alerting.azurerm_resource_group_template_deployment.custom_alert[0] will be created
  + resource "azurerm_resource_group_template_deployment" "custom_alert" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "CaTH-Courtel-Subscription-Error-Alerting"
      + output_content      = (known after apply)
      + parameters_content  = jsonencode(
            {
              + actionGroupName          = {
                  + value = "CaTH Email Group"
                }
              + actionGroupRg            = {
                  + value = "pip-ss-stg-rg"
                }
              + alertDesc                = {
                  + value = "Triggers when failing to send subscription to third party"
                }
              + alertName                = {
                  + value = "CaTH-Courtel-Subscription-Error-Alerting"
                }
              + appInsightsName          = {
                  + value = "pip-ss-stg-java-appinsights"
                }
              + appInsightsQuery         = {
                  + value = "requests | where name == \"POST /notify/api\" and resultCode != 200"
                }
              + commonTags               = {
                  + value = "eyJhcHBsaWNhdGlvbiI6InB1Ymxpc2hpbmctaW5mb3JtYXRpb24tc2VydmljZSIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvcGlwLXNoYXJlZC1pbmZyYXN0cnVjdHVyZXMuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ3Jvc3MtQ3V0dGluZyIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcHVibGlzaGluZy1hbmQtaW5mb3JtYXRpb24iLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJGdXR1cmUgSGVhcmluZ3MgLSBQdWJsaXNoaW5nIEluZm9ybWF0aW9uIFByb2plY3QifQ=="
                }
              + customEmailSubject       = {
                  + value = "Error when sending subscription to third party"
                }
              + frequencyInMinutes       = {
                  + value = "5"
                }
              + location                 = {
                  + value = "uksouth"
                }
              + severityLevel            = {
                  + value = "2"
                }
              + timeWindowInMinutes      = {
                  + value = "5"
                }
              + triggerThreshold         = {
                  + value = "0"
                }
              + triggerThresholdOperator = {
                  + value = "GreaterThan"
                }
            }
        )
      + resource_group_name = "pip-ss-stg-rg"
      + template_content    = (known after apply)
    }

Plan: 6 to add, 4 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":157,"Program":"tfcmt","SHA1":"","Vars":{}} -->